# --------------------------------------------------------------------------------------------------------------------------------------------
# N개의 정수가 주어진다. 이때, 최솟값과 최댓값을 구하는 프로그램을 작성하시오.

# n = int(input())
# for i in range(1, n+1):
#     l = list(map(int, input().split()))
#     print(min(l),max(l))
#     break




# --------------------------------------------------------------------------------------------------------------------------------------------
# 9개의 서로 다른 자연수가 주어질 때,
# 이들 중 최댓값을 찾고 그 최댓값이 몇 번째 수인지를 구하는 프로그램을 작성하시오.
# 예를 들어, 서로 다른 9개의 자연수
# 3, 29, 38, 12, 57, 74, 40, 85, 61
# 이 주어지면, 이들 중 최댓값은 85이고, 이 값은 8번째 수이다.

# a = [] # a 변수를 list 타입으로 선 지정
# for i in range(9):
#     b = input()
#     a.append(b) # list 요소 추가
# print(max(a)) # list 요소 중 MAX 값
# print(a.index(max(a)) + 1) # index 아래 MAX값 중 위치



